# Topic 11: Pandas

We are starting a new module, _Analytics_.  Our first stop will be to explore some of the capabilities of the _Pandas_ package, which provides efficient storage and manipulations of vectors and arrays of data.  As we look to perform analytics on data, in many cases we use Pandas to hold that data.

Feel free to download this lecture from Canvas.  This is a Jupyter Notebook, an ipynb file. Place this in one of your project directories.  In addition, there is a related zip file containing a few data files.  Download the zip as well, and extract the files into that same project directory.  Then activate that directory's environment and run Jupyter Notebook from there.  You can then run these examples live.  Feel free to experiment, either changing some of the cells, then rerunning them to see the changes, or by creating new cells and experimenting there.  One of the best ways to learn is by doing (I've heard that somewhere), so take some time and experiment.

## Importing Packages

When we create a new Jupyter notebook, one of the first things we would do is import the packages that we will be using.  In addition to importing Pandas, we frequently also import _numpy_ and _matplotlib_.  This lecture mostly focuses on Pandas, but we will touch briefly on these others.  Typically we would import the packages in the first cell of the notebook, as shown here:  (Be sure to run the cell, so that the imports will actually happen!)

In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

When that cell is run, the notebook does not generate any output, but the packages are loaded and available to use.

Note that the import of pandas also gave a new name, 'pd', for the package.  This is for our convenience, so we can use the abbreviation in our code.  Instead of saying 'pandas.Series(...)' we can say 'pd.Series(...)', and so on.

## Pandas Series

Pandas contains two basic data structures which we will use a lot.  The first, which is the simplest, but not that frequently used, is a vector, which Pandas calls a 'Series'.

We could use a Python array, but Python arrays are not very efficient.  They take more memory, using them is slower, and Python does not provide many of the useful methods that Pandas provides.  For this reason, we will prefer to use a Series.

However, one of the ways to construct a Series is to first build an array of data in Python, then pass this to Pandas.  Pandas will convert the array to a Series, and from then on things run better.  Here is a simple example:

In [18]:
data = [4, 8, 15, 16, 23, 42]

vec = pd.Series(data)

vec

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

* In the first line, we construct a Python array.

* In the second line, we ask Pandas to create a Series from this array.

* In the third line, we ask Python to _print out_ this Series.  When you run the cell, it will list the contents of _vec_ just below the cell.

We could have also combined the first two lines, as follows:

In [19]:
vec = pd.Series([4, 8, 15, 16, 23, 42])

vec

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

For this simple example, we build an array in Python, then used this to initialize the Series.  In a more realistic example, we would either have programmatically built the vector, or we would have loaded the data from an external file.  We will see examples of this in a few minutes.

Just a few notes about the output of that Series:

* Each line displays one cell of the Series (one entry in the vector).  The line first displays the index, then it displays the value in the cell.

* At the end, Pandas prints the datatype of the values, if all of the cells have the same type of data.  In this case, these are all 64-bit integer values.

* If the values are strings, or if the types are objects, arrays, or have mixed type, the datatype listed is 'object'

The following examples show these details.

In [20]:
pd.Series([1.2, 3.7, 7.4])

0    1.2
1    3.7
2    7.4
dtype: float64

In [21]:
pd.Series([True, False, False, True])

0     True
1    False
2    False
3     True
dtype: bool

In [22]:
pd.Series(['one', 'two', 'three'])

0      one
1      two
2    three
dtype: object

In [23]:
pd.Series([4, 5, 'six', 5 < 8, [2, 3], 9])

0         4
1         5
2       six
3      True
4    [2, 3]
5         9
dtype: object

## Pandas DataFrame
The second basic data structure in Pandas, the one used most often, is _DataFrame_, which represents a tabular arrangement of data, with rows and columns.  You can think of this as a mini-EXCEL spreadsheet, or as a database table.

Each column has a name, and all of the _cells_ below it form a Series.

Each row has an index, and represents one _entry_ in the table.

The first row has an index of 0.  In each of the columns, the cell at index 0 gives the corresponding value for this entry.

Enough talking, let's see an example.  In the following cell, we define a Python object, which is a set of key/value pairs.  Each of the keys are in fact the name of a column, and the associated value is an array containing the data to be placed in that column.

In [24]:
data = {
    'Burger': [ 'Big Mac', 'Whopper', 'Double Double', 'The Big Carl', 
            'Charburger', 'Red\'s Tavern Double', 'Double Del Cheeseburger'],
    'Cost': [3.99, 4.19, 3.45, 5.19, 3.45, 6.99, 6.39],
    'Calories': [563, 677, 670, 920, 470, 650, 720]}

We can turn this inefficient Python 'table' into an efficient Pandas DataFrame as follows.

In [25]:
burgers = pd.DataFrame(data)

Now that we have a DataFrame, we can print out the contents by simply listing the Dataframe:

In [26]:
burgers

                    Burger  Cost  Calories
0                  Big Mac  3.99       563
1                  Whopper  4.19       677
2            Double Double  3.45       670
3             The Big Carl  5.19       920
4               Charburger  3.45       470
5      Red's Tavern Double  6.99       650
6  Double Del Cheeseburger  6.39       720

In this case we are taking all of the columns.  But in other examples, we might have a large data object, but we only want to use portions of it in our code.  So we list the columns of interest.  Pandas will then only take the columns that we indicated.  Notice, by the way, that we can rearrange the columns, and even duplicate the columns!

In [27]:
burgers2 = pd.DataFrame(data, columns = ['Cost', 'Burger', 'Calories', 'Cost'])

burgers2

   Cost                   Burger  Calories  Cost
0  3.99                  Big Mac       563  3.99
1  4.19                  Whopper       677  4.19
2  3.45            Double Double       670  3.45
3  5.19             The Big Carl       920  5.19
4  3.45               Charburger       470  3.45
5  6.99      Red's Tavern Double       650  6.99
6  6.39  Double Del Cheeseburger       720  6.39

In this example, the table was small, so the whole table was printed.  If the table had many lines, the output would have listed the header of the table, the first few lines, then a line of ellipses (...), then the last few lines.

Entering data using the Python object/arrays is very inefficient.  If we were algorithmically generating the data, we would write a program to construct the input data.  However, in most cases, we would read the data into the DataFrame from an external file.  Pandas supports reading data in a variety of formats, but one of the easiest and most common is to use a CSV (_comma-separated-value_) file.  In this file, the first row provides the names of all the columns, and each of the remaining rows gives the values for one entry (row) in the DataFrame.  Commas are used to indicate when to switch to the next column.

The following line of code shows how to load the data from a CSV file.  If you have loaded the files from the zip file, then the following cell will be able to find the file and extract the data.

In [28]:
spiderman = pd.read_csv('spiderman.csv')

Having loaded the data, we can then print out the contents of the DataFrame:

In [29]:
spiderman

,Film,Release Date,Actor,NA Box Office,Other Box Office,Ranking,Budget,Rotten Tomatoes,Metacritic
0,Spider-Man,"May 3, 2002",Tobey Maguire,407.02,418.00,35,139,90,73
1,Spider-Man 2,"June 30, 2004",Tobey Maguire,373.59,415.39,46,200,93,83
2,Spider-Man 3,"May 4, 2007",Tobey Maguire,336.53,558.45,60,258,63,59
3,The Amazing Spider-Man,"July 3, 2012",Andrew Garfield,262.03,495.90,115,230,72,66
4,The Amazing Spider-Man 2,"May 2, 2014",Andrew Garfield,202.85,506.13,208,250,52,53
5,Spider-Man: Homecoming,"July 7, 2017",Tom Holland,334.20,545.97,64,175,92,73
6,Spider-Man: Far From Home,"July 2, 2019",Tom Holland,390.53,741.40,40,160,97,87
7,Spider-Man: No Way Home,"December 17, 2021",Tom Holland,814.27,1379.66,3,200,90,69
8,Spider-Man: Into the Spider-Verse,"December 14, 2018",Shameik Moore,190.24,185.30,232,90,93,71

As mentioned when loading from a Python object, we can also select which columns of data to load, as follows.

In [30]:
spiderman = pd.read_csv('spiderman.csv',
                       usecols = ['Film', 'Actor', 'Release Date', 'Ranking', 
                                  'Rotten Tomatoes', 'Metacritic'])

We can then print this out and see that only the requested columns appear:

In [31]:
spiderman

,Film,Release Date,Actor,Ranking,Rotten Tomatoes,Metacritic
0,Spider-Man,"May 3, 2002",Tobey Maguire,35,90,73
1,Spider-Man 2,"June 30, 2004",Tobey Maguire,46,93,83
2,Spider-Man 3,"May 4, 2007",Tobey Maguire,60,63,59
3,The Amazing Spider-Man,"July 3, 2012",Andrew Garfield,115,72,66
4,The Amazing Spider-Man 2,"May 2, 2014",Andrew Garfield,208,52,53
5,Spider-Man: Homecoming,"July 7, 2017",Tom Holland,64,92,73
6,Spider-Man: Far From Home,"July 2, 2019",Tom Holland,40,97,87
7,Spider-Man: No Way Home,"December 17, 2021",Tom Holland,3,90,69
8,Spider-Man: Into the Spider-Verse,"December 14, 2018",Shameik Moore,232,93,71

## Examining the Data
We can get a quick peek at the contents of the table using the _head_ method.  This will print the header of the table, then list the first five rows of data.  We would typically use this so we can verify that the data loaded correctly, or to see what kind of data is in the DataFrame.

In the second example that follows, we can pass a number to the _head_ method.  This overrides the default value of '5', so we can, for example, look at the first three rows of data in the file.

In [32]:
spiderman.head()

,Film,Release Date,Actor,Ranking,Rotten Tomatoes,Metacritic
0,Spider-Man,"May 3, 2002",Tobey Maguire,35,90,73
1,Spider-Man 2,"June 30, 2004",Tobey Maguire,46,93,83
2,Spider-Man 3,"May 4, 2007",Tobey Maguire,60,63,59
3,The Amazing Spider-Man,"July 3, 2012",Andrew Garfield,115,72,66
4,The Amazing Spider-Man 2,"May 2, 2014",Andrew Garfield,208,52,53

In [33]:
spiderman.head(3)

,Film,Release Date,Actor,Ranking,Rotten Tomatoes,Metacritic
0,Spider-Man,"May 3, 2002",Tobey Maguire,35,90,73
1,Spider-Man 2,"June 30, 2004",Tobey Maguire,46,93,83
2,Spider-Man 3,"May 4, 2007",Tobey Maguire,60,63,59

There is another method, _tail_, which lists rows at the bottom of the table.  Again, the table header is drawn, but then the last five rows of data are displayed.  You can also pass a number to _tail_ to change the number of rows displayed.

In [34]:
spiderman.tail()

,Film,Release Date,Actor,Ranking,Rotten Tomatoes,Metacritic
4,The Amazing Spider-Man 2,"May 2, 2014",Andrew Garfield,208,52,53
5,Spider-Man: Homecoming,"July 7, 2017",Tom Holland,64,92,73
6,Spider-Man: Far From Home,"July 2, 2019",Tom Holland,40,97,87
7,Spider-Man: No Way Home,"December 17, 2021",Tom Holland,3,90,69
8,Spider-Man: Into the Spider-Verse,"December 14, 2018",Shameik Moore,232,93,71

We can ask for just the names of the columns, by accessing the _columns_ attribute.  This contains an _index_ object that has an array of the names, and an indication of the datatype of this array, which will be _object_ (since the entries are strings).

In [35]:
spiderman.columns

Index(['Film', 'Release Date', 'Actor', 'Ranking', 'Rotten Tomatoes',
       'Metacritic'],
      dtype='object')

We can also ask for the datatypes for each of the columns, using _dtypes_.  This returns a Series that uses the column names as the indices and the corresponding datatypes as the values.  If a column has mixed types, it lists the type _object_.

In [36]:
spiderman.dtypes

Film               object
Release Date       object
Actor              object
Ranking             int64
Rotten Tomatoes     int64
Metacritic          int64
dtype: object

Going in the other dimension, we can ask for information about the rows.  While the columns have names, the rows simply have an index.  If we access the _index_ attribute, Pandas will print a description of the indices.  In a typical case, there are many rows, and these are sequentially numbered, so in most cases Pandas does not enumerate all of the values, but rather shows the _formula_ for computing the indices.

In [37]:
spiderman.index

RangeIndex(start=0, stop=9, step=1)

The above states that the indices form a single _range_, which starts at 0 and ends _before_ 9, incrementing by 1.  So the indicies run from 0 to 8, inclusive.

We can extract a Python array from the DataFrame.  This is not frequently done, but maybe you will be performing computations on this array, and would rather not use the DataFrame object.  Access the _values_ attribute to get the data as an array.

The result is actually a 2-dimensional array.  The outer array is the list of rows, and each row is an array of each of the column values for that row.

In [38]:
spiderman.values

array([['Spider-Man', 'May 3, 2002', 'Tobey Maguire', 35, 90, 73],
       ['Spider-Man 2', 'June 30, 2004', 'Tobey Maguire', 46, 93, 83],
       ['Spider-Man 3', 'May 4, 2007', 'Tobey Maguire', 60, 63, 59],
       ['The Amazing Spider-Man', 'July 3, 2012', 'Andrew Garfield', 115,
        72, 66],
       ['The Amazing Spider-Man 2', 'May 2, 2014', 'Andrew Garfield',
        208, 52, 53],
       ['Spider-Man: Homecoming', 'July 7, 2017', 'Tom Holland', 64, 92,
        73],
       ['Spider-Man: Far From Home', 'July 2, 2019', 'Tom Holland', 40,
        97, 87],
       ['Spider-Man: No Way Home', 'December 17, 2021', 'Tom Holland', 3,
        90, 69],
       ['Spider-Man: Into the Spider-Verse', 'December 14, 2018',
        'Shameik Moore', 232, 93, 71]], dtype=object)

Another convenient method is _describe_.  This examines all of the columns that contain numeric data, outputing a chart that gives typical summary information for the columns.

In [39]:
spiderman.describe()

          Ranking  Rotten Tomatoes  Metacritic
count    9.000000         9.000000    9.000000
mean    89.222222        82.444444   70.444444
std     80.088666        16.024287   10.619688
min      3.000000        52.000000   53.000000
25%     40.000000        72.000000   66.000000
50%     60.000000        90.000000   71.000000
75%    115.000000        93.000000   73.000000
max    232.000000        97.000000   87.000000

* The _count_ row gives the number of entries in each column.
* The _mean_ row gives the average value for each column.
* The _std_ row gives the standard deviation for each column (we will talk about _standard deviation_ in a few lectures).
* The _min_ row gives the smallest value in each column.
* The _max_ row gives the largest value in each column.
* The _25%_, _50%_, and _75%_ values list the column entries such that 25% (or 50%, or 75%) of all the entries have that value or less.

## Modifying the Data
One change that can be made to the data is to change the names of the columns.  Perhaps some of the column names are fairly long, or maybe not descriptive.  Maybe you just want to change the name.  Recall that these column names may have come from the CSV file, or other external representation, so up to this point the names are out of your control.

However, recall that the _DataFrame_ has a _columns_ attribute, which gives the names of the columns.  You can rename the columns by assigning a new array of strings to the _columns_ attributes!  Note that the size of this array must match the number of columns in the _DataFrame_.

In [40]:
spiderman.columns= ['Film', 'Date', 'Actor', 'Rank', 'Tomatoes', 'Critic']

spiderman

,Film,Date,Actor,Rank,Tomatoes,Critic
0,Spider-Man,"May 3, 2002",Tobey Maguire,35,90,73
1,Spider-Man 2,"June 30, 2004",Tobey Maguire,46,93,83
2,Spider-Man 3,"May 4, 2007",Tobey Maguire,60,63,59
3,The Amazing Spider-Man,"July 3, 2012",Andrew Garfield,115,72,66
4,The Amazing Spider-Man 2,"May 2, 2014",Andrew Garfield,208,52,53
5,Spider-Man: Homecoming,"July 7, 2017",Tom Holland,64,92,73
6,Spider-Man: Far From Home,"July 2, 2019",Tom Holland,40,97,87
7,Spider-Man: No Way Home,"December 17, 2021",Tom Holland,3,90,69
8,Spider-Man: Into the Spider-Verse,"December 14, 2018",Shameik Moore,232,93,71

If we _index_ into the _DataFrame_, passing the name of one of the columns, the return value is a _Series_ that contains the values of that column:

In [41]:
spiderman['Film']

0                           Spider-Man
1                         Spider-Man 2
2                         Spider-Man 3
3               The Amazing Spider-Man
4             The Amazing Spider-Man 2
5               Spider-Man: Homecoming
6            Spider-Man: Far From Home
7              Spider-Man: No Way Home
8    Spider-Man: Into the Spider-Verse
Name: Film, dtype: object

If we _index_ into the _DataFrame_ by giving two index values, separated by a colon (the typical Python method to declare a range of values), the return is a new _DataFrame_ containing only the selected rows.  There are a couple of notes:
* The first number gives the first index, inclusive.
* The second number gives the final index, exclusive.
* Note that the index values for this new _DataFrame_ match the index values from the original _DataFrame_, so they don't necessarily start with 0!

In [42]:
spiderman[3:5]

,Film,Date,Actor,Rank,Tomatoes,Critic
3,The Amazing Spider-Man,"July 3, 2012",Andrew Garfield,115,72,66
4,The Amazing Spider-Man 2,"May 2, 2014",Andrew Garfield,208,52,53

## Digression
To illustrate the next couple of points, we will move from our Spiderman _DataFrame_, but we will return soon!

For some use cases, you might need an array of randomly generated values.  Let's build such an array!

The core routine we will use is a method in _numpy_ which builds a 2-dimensional array of random values (you can also build 1-dimensional arrays or 3-dimensional arrays, but that would be a digression of our digression...)

In [43]:
np.random.randn(4, 5)

array([[ 0.28823179,  0.27389566, -0.78924038, -0.55404335,  0.29125697],
       [-1.30793468, -0.66425967, -0.49588264,  0.28272147,  0.84464045],
       [ 0.36940657, -0.30903206,  0.04946907,  0.35022971, -0.8202714 ],
       [ 1.6927837 , -1.14945588, -0.42940336, -1.87575824, -0.35471414]])

That works fine to get the data for the _DataFrame_.  But maybe we want to provide interesting column names.
We could simply provide an array of names.  However, since this is just random data, and we don't have any more descriptive names for the columns, we can just label the columns 'A', 'B', ...
* We could give the column names like this: ['A', 'B', 'C', 'D', 'E']
* Alternatively, we can use the String _list_ method: list('ABCDE').  That list method makes an array where each entry in the array is a single-character string taken from the input parameter.
* If we don't give any column names, Pandas will just name the first column '1', the second column '2', etc.

In [44]:
list('ABCDE')

['A', 'B', 'C', 'D', 'E']

We can also give interesting row 'names', which are the indicies.  

If we don't give row names, Pandas will simply sequentially number the rows.

For this example, let's create row index values as dates.  Pandas has a function, _date_range_, which will compute an array of index values, given a starting date and the number of indicies to generate:

In [45]:
dates = pd.date_range('2022-9-15', periods=12)

dates

DatetimeIndex(['2022-09-15', '2022-09-16', '2022-09-17', '2022-09-18',
               '2022-09-19', '2022-09-20', '2022-09-21', '2022-09-22',
               '2022-09-23', '2022-09-24', '2022-09-25', '2022-09-26'],
              dtype='datetime64[ns]', freq='D')

Putting this all together, the following creates a new _DataFrame_, based on an array of randomly generated values, and given the _date_ indicies (from the previous cell), and the simple column names:

In [46]:
rnd = pd.DataFrame(np.random.randn(12, 5), index = dates, columns = list('ABCDE'))

rnd

                   A         B         C         D         E
2022-09-15 -2.476591 -1.360597  0.786757 -0.664064 -0.538548
2022-09-16  0.191253 -0.448351 -0.752627 -0.434944 -1.064435
2022-09-17  2.831372 -1.189524  0.858377  1.777711 -0.677857
2022-09-18  0.739316  0.815183 -1.192188  0.042972  1.639197
2022-09-19 -0.073076  0.123033  0.914856 -1.557583  0.286880
2022-09-20 -0.724375 -0.180327 -0.494893 -1.646911  0.761898
2022-09-21  0.627713  2.584680  0.499273  1.177158  1.935845
2022-09-22  0.728774 -0.858160  0.004176  0.655858 -0.643614
2022-09-23 -0.645873  0.721220 -0.124883 -0.432339 -0.631545
2022-09-24 -1.432190  0.020501  1.127569 -0.227590  0.416605
2022-09-25 -1.809656  0.442460 -0.073325  0.730259  1.319863
2022-09-26 -0.164801  0.439266  0.973792  1.550617  0.446161

As shown previously, we can run the _describe()_ method to get an overview of the data:

In [47]:
rnd.describe()

               A          B          C          D          E
count  12.000000  12.000000  12.000000  12.000000  12.000000
mean   -0.184011   0.092449   0.210574   0.080929   0.270871
std     1.399758   1.061866   0.761774   1.121861   1.001231
min    -2.476591  -1.360597  -1.192188  -1.646911  -1.064435
25%    -0.901329  -0.550803  -0.217386  -0.492224  -0.634562
50%    -0.118939   0.071767   0.251725  -0.092309   0.351742
75%     0.652978   0.512150   0.872497   0.841984   0.901389
max     2.831372   2.584680   1.127569   1.777711   1.935845

## Undigression?

Back to our Spiderman example.  Previously we showed how to extract a single column from the _DataFrame_, or how to extract a series of rows.  These techniques can be combined to select a _region_ from the _DataFrame_: we list the range of rows, and list the set of columns to keep:

In [48]:
spiderman.loc[3:5, ['Film', 'Actor']]

                       Film            Actor
3    The Amazing Spider-Man  Andrew Garfield
4  The Amazing Spider-Man 2  Andrew Garfield
5    Spider-Man: Homecoming      Tom Holland

The annoying thing about this?  Note that for the _loc_ function, the upper number in the range is _included_, while in the previous examples it is _excluded_.  Sigh.

We can also get the contents of a single cell by giving one specific index and one specific column name:

In [49]:
spiderman.loc[3, 'Actor']

'Andrew Garfield'

There are two ways to select a cell, using _loc_ and using _at_, as shown below.

In [50]:
spiderman.at[3, 'Actor']

'Andrew Garfield'

## Index by Position
In the previous examples, we were indicating specific rows by giving the index 'label' of the row, and indicating specific columns by column name.  One subtle thing: If we create a sub-_DataFrame_, it's rows will have the same indicies as the original table.

An alternate way to select is using the _iloc_ method, which always indexes by an integer, and this is always the current order in the specific _DataFrame_.  In the following example, we give a single integer value, so this 'selects' the row with that index.  The return value is a _Series_.

In [51]:
spiderman.iloc[2]

Film         Spider-Man 3
Date          May 4, 2007
Actor       Tobey Maguire
Rank                   60
Tomatoes               63
Critic                 59
Name: 2, dtype: object

If we give two values, the first index selects which row, and the second index selects which column in that row.  The return value is the specific cell contents.  As usual, the indicies start at 0.

In [52]:
spiderman.iloc[2, 1]

'May 4, 2007'

A range of values can be given, rather than specific numbers.  In this case, a _DataFrame_ will be returned.  Also note that in this instance, the last or upper values specified are _exclusive_.

In [53]:
spiderman.iloc[2:4, 1:3]

           Date            Actor
2   May 4, 2007    Tobey Maguire
3  July 3, 2012  Andrew Garfield

As yet another option, an array of values can be passed for either or both of the dimensions.  In this case, the resulting _DataFrame_ will have the indicated set of rows and the indicated set of columns.

In [54]:
spiderman.iloc[[1,3,5],[0,2]]

                     Film            Actor
1            Spider-Man 2    Tobey Maguire
3  The Amazing Spider-Man  Andrew Garfield
5  Spider-Man: Homecoming      Tom Holland

I did a couple of experiments.  In the following, the row and column numbers were not in increasing order.  The output _DataSet_ had the rows and columns in the order I specified.

In [55]:
spiderman.iloc[[1,5,3],[2,0]]

             Actor                    Film
1    Tobey Maguire            Spider-Man 2
5      Tom Holland  Spider-Man: Homecoming
3  Andrew Garfield  The Amazing Spider-Man

This led, of course, to one more experiment: What if one of the index values was repeated?  Answer: It did what I asked, and duplicated the row of data!

In [56]:
spiderman.iloc[[1,3,1],[0,2]]

                     Film            Actor
1            Spider-Man 2    Tobey Maguire
3  The Amazing Spider-Man  Andrew Garfield
1            Spider-Man 2    Tobey Maguire

## Boolean Indexing

Comparisons can be performed upon a _Series_.  This will create a new boolean _Series_, where each value of the output is the result of performing the comparison upon the corresponding value of the input.  Recall that we can get a _Series_ from the _DataFrame_ by indexing with the name of a column.  So, for example, we can get a boolean _Series_ that indicates which rows of the table have Tobey Maguire as the actor:

In [57]:
spiderman['Actor'] == 'Tobey Maguire'

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
Name: Actor, dtype: bool

As a more complex example, we can get a vector indicating where 'Tomatoes' has a score of 90 or higher and where 'Critic' has a score of 80 or higher.  Also note in this example that we can select a column by using the dot notation rather than indexing by the column name!  _Note: for this example, the parentheses are required.  Otherwise Python has trouble parsing the expression._

In [58]:
(spiderman.Tomatoes >= 90) & (spiderman.Critic >= 80)

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7    False
8    False
dtype: bool

What is the use of these boolean _Series_?

We can use them to index the _DataFrame_.  The result is that we get a new _DataFrame_ which only contains the rows where the expression evaluated to _TRUE_:

In [59]:
spiderman[spiderman.Actor == 'Tobey Maguire']

           Film           Date          Actor  Rank  Tomatoes  Critic
0    Spider-Man    May 3, 2002  Tobey Maguire    35        90      73
1  Spider-Man 2  June 30, 2004  Tobey Maguire    46        93      83
2  Spider-Man 3    May 4, 2007  Tobey Maguire    60        63      59

Another little more complex example:

In [60]:
spiderman[(spiderman['Rank'] < 50) & (spiderman['Critic'] > 80)]

,Film,Date,Actor,Rank,Tomatoes,Critic
1,Spider-Man 2,"June 30, 2004",Tobey Maguire,46,93,83
6,Spider-Man: Far From Home,"July 2, 2019",Tom Holland,40,97,87

## Adding Columns
A new column can be added to a _DataFrame_ simply by selecting a new column and providing an array of data.  The array should have the same length as the number of rows in the _DataFrame_:

In [61]:
spiderman['Score'] = [100, 90, 95, 80, 85, 75, 60, 92, 40]

In [62]:
spiderman

,Film,Date,Actor,Rank,Tomatoes,Critic,Score
0,Spider-Man,"May 3, 2002",Tobey Maguire,35,90,73,100
1,Spider-Man 2,"June 30, 2004",Tobey Maguire,46,93,83,90
2,Spider-Man 3,"May 4, 2007",Tobey Maguire,60,63,59,95
3,The Amazing Spider-Man,"July 3, 2012",Andrew Garfield,115,72,66,80
4,The Amazing Spider-Man 2,"May 2, 2014",Andrew Garfield,208,52,53,85
5,Spider-Man: Homecoming,"July 7, 2017",Tom Holland,64,92,73,75
6,Spider-Man: Far From Home,"July 2, 2019",Tom Holland,40,97,87,60
7,Spider-Man: No Way Home,"December 17, 2021",Tom Holland,3,90,69,92
8,Spider-Man: Into the Spider-Verse,"December 14, 2018",Shameik Moore,232,93,71,40

A _DataFrame_ can be _transposed_, which switches the rows and columns, using the _T_ 'attribute':

In [63]:
spiderman.T

,0,1,2,3,4,5,6,7,8
Film,Spider-Man,Spider-Man 2,Spider-Man 3,The Amazing Spider-Man,The Amazing Spider-Man 2,Spider-Man: Homecoming,Spider-Man: Far From Home,Spider-Man: No Way Home,Spider-Man: Into the Spider-Verse
Date,"May 3, 2002","June 30, 2004","May 4, 2007","July 3, 2012","May 2, 2014","July 7, 2017","July 2, 2019","December 17, 2021","December 14, 2018"
Actor,Tobey Maguire,Tobey Maguire,Tobey Maguire,Andrew Garfield,Andrew Garfield,Tom Holland,Tom Holland,Tom Holland,Shameik Moore
Rank,35,46,60,115,208,64,40,3,232
Tomatoes,90,93,63,72,52,92,97,90,93
Critic,73,83,59,66,53,73,87,69,71
Score,100,90,95,80,85,75,60,92,40

You can add a new row.  You can change the value of one cell.  But we don't usually do this, usually we are just processing the data we have received.

## Experiment

Make a Jupyter Notebook of your own, load some data, then explore what you can do.

In addition to the Spiderman dataset, in 'spiderman.csv', I've also included a dataset covering some James Bond (007) movies, in the file 'jamesbond.csv'.  Load that data file, then experiment!